# Area Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuit..::..Area Property
PlanCircuit Class See Also
---
The enclosed area of the circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace